let a = document.querySelector('.b1'); 
let b = document.querySelector('.b2'); 
let c = document.querySelector('.b3'); 

let t = document.querySelector('.t'); 

let myText =`Мультимедияның пайда болуына байланысты динамикалық (аудио, видео, анимация) және статикалық (текст, графикалар, суреттер) құрамы бар компьютерлік интеграция мүмкіндігі туды. 
Түйіндер мен байланыстар комбинациясы гипертекстік жүйе мультимедиасында жңа ортаны құруға мүмкіндік берді.
Гипермедиа – бұл мәліметтер көрінісі және оған кіру әдісі.
Оның концепциясы граф түрінде берілген мәліметтер кеңістігінің моделінде орналасады, түйіндерінде мәліметтер, ал семантикалық байланыс граф доғасында қамтылады.
 Ақиқатты гипермедия жүйесіндегі сақталатын мәлімет осы заманғы компьютер шығара алатын барлық мүмкін формалармен көрсетіледі. 
Сонымен қатар, гипермедиа өзінде радио (аудио), теледидар (динамикалық бейне), пресса (текст, суреттер, фотосуреттер) және компьютер (видеотерминал) компьютерлік гиперортада құрамында жататын гипертекстік байланыстарды орнатады.
`

let myTest =`«Қолданбалы оңтайландыру әдістері» пәнінен 
Қорытынды бақылау сұрақтарының тізімі 
 
1. Қандай шарт орындалғанда көлік есебінің шешімі болады? 
2.Алғашқы таяныш жоспар қандай әдістермен табылады? 
3.Көлік есебінің жабық және ашық моделдерінің айырмашылығы неде? 
4.Мүмкін таяныш жоспар дегеніміз не? 
5.Көлік есебінің ашық моделі жабық модельге қалай келтіріледі? 
6.Қандай жоспар айныған деп аталады? 
7.Потенциалдар қалай табылады? 
8.Оптималдылық шарты қандай клеткаларда орындалуы тиіс? 
9.Оптимал шешім дегеніміз не? 
10.Көлік есебінің моделі экономика саласында қандай есептерді шешуге арналған? 
11.Көлік есебінің мақсат функциясы қандай мәнге шығарылады. 
12.Экономикалық динамика және оны үлгілеу. Экономикадағы динамикалық тепе-теңдіктің ұғымы. 
13.Нарықтық моделдердің талдауы. Бағалық икемділік коэффициенті. Табыстың  икемділік коэффициенті. Қиылысқан икемділік коэффициенті. 
14. Нарықтық экономика есептерінің моделдері. Ұсыныс қисығы. Жеке және нарықтық ұсыныстар. Ұсыныс функциясының жалпы түрі. 
15.Функционалдық тәуелділік ұғымы. Функцияларды тағайындау және оларды зерттеу тәсілдері. Функциялардың негізгі элементтері және олардың графиктері. 
16.Экономикалық динамика және оны үлгілеу. Экономикадағы динамикалық тепе-теңдіктің ұғымы. 
17.Нарықтық моделдердің талдауы. Бағалық икемділік коэффициенті. Табыстың  икемділік коэффициенті. Қиылысқан икемділік коэффициенті. 
18.Қаржы нарығының математикалық үлгісі. Бағалы қағаздар нарығын оптималдау. Бағалы қағаздар нарығындағы тепе-теңдік. 
19.Функцияның икемділігі және оның геометриялық мағынасы. Икемділіктің қасиеттері және қарапайым функциялардың икемділігі. Икемділікті экономикалық талдауда қолдану. 
20. Көпшілікке қызмет көрсету жүйелерін математикалық  жабдықтау. Көпшілікке қызмет көрсету жүйелерінің кезекке тұруын зерттеу. 
21. Экономикалық ақпараттық жүйелердегі математикалық жабдықтаудың қолданылу облыстары және  талдауы. 
22.ЭАЖ-дағы үлгілеу ұғымы. Математикалық үлгілердің ерекшеліктері, олардың түрлері. \b
23.Мемлекеттік экономиканы реттеуінің математикалық үлгілері. Қоғамдық таңдаудың математикалық теориясы. Экономикаға мемлекеттік әсер етуді моделдеу. 
24. Қаржы нарығының математикалық үлгісі. Бағалы қағаздар нарығын оптималдау. Бағалы қағаздар нарығындағы тепе-теңдік. 
25.Шектеулі қорларды тиімді бөлу есебінің жалпы моделін алу. Шектеулерінің, мақсат функциясының экономикалық мәні. Шешу әдістері. 
26.Көпшілікке қызмет көрсету жүйелерін математикалық жабдықтау. 
27.Қандай шарт орындалғанда көлік есебінің шешімі болады? 
28.Алғашқы таяныш жоспар қандай әдістермен табылады? 
29.Көпшілікке қызмет көрсету жүйелерінің кезекке тұруын зерттеу. 
30.Экономикалық үлгінің толымсыздығы. Экономикалық жүйелердегі математикалық үлгілеудің ролі.`;


let mySog = `№1 СӨЖ. Сызықты программалау есептерін шешу 

Операцияны зерттеу есептері екі категорияға бөлінеді: а) тура және б) кері. Тура есептер келесі сұрақтарға жауап береді: егер берілген шартқа сәйкес х   х шешімін алатын болсақ, онда w тиімділік көрсеткіші неге тең болады? 
Мұндай есептерді шығару үшін бір немесе бірнеше тиімділік көрсеткішін өрнектейтін математикалық модель құрылады.
Кері есептер келесі сұрақтарға жауап береді: w тиімділік көрсеткіші максимум мәнге айналу үшін х шешімін қалай таңдау қажет?
Шындығында, тура есептер кері есептерге қарағанда әлдеқайда оңай. Кері есептерді шығару үшін тура есептерді шығара білу шарт.
Операцияны зерттеудің кері есептерін оптималдау үшін есептің қойылуын жалпы түрде қарастырайық. Мысалы: х шешімдерін таңдай отырып, біз әсер ете алатын бір а операциясы бар делік (х – параметрлер тобы болсын). 
Операция шарты түгелдей белгілі болған «анықталған» деп аталатын ең қарапайым жағдайды алайық. Ол кезде операция табысы тәуелді болатын барлық факторлар екі топқа бөлінеді:
Егер дұрыстап қарасақ, бірінші топтағы факторларға шектеулер енетіндігін көреміз, яғни х шешімінің мүмкін облысын анықтайды.
W – тиімділік көрсеткіші екі топ факторларынан тәуелді. Оны келесі формула түрінде көрсетуге болады:
					W = w ( , х)                             (4.1).
Мұндағы х және   жалпы жағдайда сан ғана емес, ал сандар жиыны.
Берілген     шарттарының нәтижесінде w тиімділік көрсеткішін максимумға айналдыратын Х=X* шешімін табу қажет. 
Ол максимум келесі түрде өрнектеледі: 
W*=max {W( ,x)} (4.2)
X X
(4.2) формула былай оқылады: W*- Х-тің мүмкін шешімдер жиынына енетін W( ,x) мәндерінің максимал мәні 
Сонымен, функцияның немесе функционалдың максимум мәнін табатын математикалық есеп алдық. Мұндай қарапайым есептер көпшілікке мәлім.
Көп аргументті функцияның максимум немесе минимум мәнін табу үшін, әрбір аргумент бойынша дифференциалдаймыз және туындыларын нөлге теңеу арқылы теңдеулер жүйелерінің шешімін аламыз. 
Былайша қарағанда оңай сияқты.
 Біріншіден аргумент көп болған кезде теңдеулер жүйесі күрделенеді, экстремум іздеу қиындайды. 
Екіншіден, шешім элементтеріне шектеулер қойылғанда экстремум туындының нөльге тең нүктесінде емес, Х облысының шекарасында табылады. 
Кейбір есптерде W функцияның туындысы табылмауы мүмкін. Соның бәрі экстремум іздеу есептерін қиындата түседі. 
Х* оптимал шешімін табатын экстремум іздеу есептері, W функциясының ерекшеліктеріне және шешімге қойылатын шектеулер түрлеріне тәуелді. Мысалы, егер W функциясы Х1 Х2 ,..., шешім элементтерінен сызықты тәуелді болса, және Х1 ,Х2 ,..., 
қойылатын шектеулер сызықтық теңдеулер немесе теңсіздіктер түрінде берілсе, онда стандартты әдістермен шешілетін классикалық сызықтық программалау есебі алынады. 
Егер W функциясы дөңес болса, онда арнайы әдістер «квадраттық программалау» әдістерімен шығарылады. Сонымен қатар экстремум табатын сандық әдістер де бар, олар ЭЕМ арнайы бағдарламалары арқылы жүзеге асады.
 Сонымен қатар оптимал табу есептері классикалық вариациялық (шектеулері бар немесе жоқ) таза математикалық есептерге келтіріледі, оларды есептеу техникаларында шығару аса қиындық туғызбайды.
 
`

a.addEventListener('click',()=>{ 
  console.log('done')
  t.textContent = myText; 
}); 

b.addEventListener('click',()=>{ 
  t.textContent = mySog;
});
c.addEventListener('click',()=>{ 
  t.textContent = myTest;
});